RETAIL_NAME_GLOBAL = "ВкусВилл"

# Карта городов и доменов
VKUSVILL_CITIES_MAP = {
    "Москва": "",
    "Санкт-Петербург": "spb.",
    "Самара": "smr.",
    "Иваново": "iva.",
    "Казань": "kzn.",
    "Екатеринбург": "ekb.",
    "Тверь": "tvr.",
    "Ярославль": "yar.",
    "Владимир": "vla.",
    "Воронеж": "vrn.",
    "Ростов-на-Дону": "rnd.",
    "Краснодар": "krr.",
    "Нижний Новгород": "nnv.",
    "Рязань": "ryz.",
    "Тула": "tul.",
    "Уфа": "ufa.",
    "Челябинск": "cek."
}

VKUSVILL_VALID_ADDRESSES = {
    "Москва": "Москва, Тверская улица, 9",
    "Санкт-Петербург": "Санкт-Петербург, Невский проспект, 35",
    "Самара": "Самара, улица Куйбышева, 100",
    "Иваново": "Иваново, проспект Ленина, 10",
    "Казань": "Казань, улица Баумана, 50",
    "Екатеринбург": "Екатеринбург, проспект Ленина, 25",
    "Тверь": "Тверь, Советская улица, 15",
    "Ярославль": "Ярославль, улица Кирова, 10",
    "Владимир": "Владимир, Большая Московская улица, 20",
    "Воронеж": "Воронеж, проспект Революции, 30",
    "Ростов-на-Дону": "Ростов-на-Дону, Большая Садовая улица, 50",
    "Краснодар": "Краснодар, Красная улица, 100",
    "Нижний Новгород": "Нижний Новгород, Большая Покровская улица, 20",
    "Рязань": "Рязань, Первомайский проспект, 35",
    "Тула": "Тула, проспект Ленина, 30",
    "Уфа": "Уфа, улица Ленина, 30",
    "Челябинск": "Челябинск, проспект Ленина, 50"
}